Revit 2027 API
BuiltInFailures.ConnectorFailures.SizingCalculationFlowOnlyWarn Property
 Some elements are not sized because the system calculation is flow only. You may change the system calculation level to size them again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SizingCalculationFlowOnlyWarn { get; }
Public Shared ReadOnly Property SizingCalculationFlowOnlyWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SizingCalculationFlowOnlyWarn {
	FailureDefinitionId^ get ();
}
static member SizingCalculationFlowOnlyWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace